tap "appleboy/tap"
tap "chiselstrike/tap"
tap "danielgtaylor/restish"
tap "homebrew/bundle"
tap "homebrew/command-not-found"
tap "homebrew/services"
tap "jstkdng/programs"
tap "koekeishiya/formulae"
tap "libsql/sqld"
tap "marwanhawari/tap"
tap "minio/stable"
tap "nginx/unit"
tap "nikitabobko/tap"
tap "siderolabs/tap"
tap "tabbyml/tabby"
tap "yqrashawn/goku"
brew "act"
brew "age"
brew "azcopy"
brew "bat"
brew "fontconfig"
brew "cloudflared"
brew "diff-so-fancy"
brew "dockerize"
brew "duti"
brew "eget"
brew "exiftool"
brew "eza"
brew "fd"
brew "flyctl"
brew "gh"
brew "tesseract"
brew "git"
brew "git-lfs"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "helm"
brew "hugo"
brew "hyperfine"
brew "jq"
brew "k3d"
brew "k9s"
brew "kubernetes-cli"
brew "kubectx"
brew "lazydocker"
brew "lazygit"
brew "lesspipe"
brew "libpq", link: true
brew "mise"
brew "mkcert"
brew "navi"
brew "neovim"
brew "nginx"
brew "ollama", restart_service: true
brew "openssl@1.1"
brew "rclone"
brew "ripgrep"
brew "sops"
brew "tmux"
brew "wget"
brew "yq"
brew "zellij"
brew "appleboy/tap/codegpt"
brew "chiselstrike/tap/turso"
brew "danielgtaylor/restish/restish"
brew "jstkdng/programs/ueberzugpp"
brew "marwanhawari/tap/stew"
brew "minio/stable/mc"
brew "siderolabs/tap/talosctl"
brew "tabbyml/tabby/tabby"
brew "yqrashawn/goku/goku"
cask "aerospace"
cask "alt-tab"
cask "anythingllm"
cask "arc"
cask "beekeeper-studio"
cask "firefox@developer-edition"
cask "font-fira-code-nerd-font"
cask "font-monaspace"
cask "iterm2"
cask "karabiner-elements"
cask "obsidian"
cask "orbstack"
cask "raindropio"
cask "raycast"
cask "shortcat"
cask "spotify"
cask "telegram"
cask "visual-studio-code"
cask "wkhtmltopdf"
cask "zed"
