tap "chiselstrike/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/services"
tap "libsql/sqld"
tap "minio/stable"
tap "nginx/unit"
# Run your GitHub Actions locally
brew "act"
# Simple, modern, secure file encryption
brew "age"
# Azure Storage data transfer utility
brew "azcopy"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Easily install prebuilt binaries from GitHub
brew "eget"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Kubernetes package manager
brew "helm"
# Command-line benchmarking tool
brew "hyperfine"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Little helper to run CNCF's k3s in Docker
brew "k3d"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Terminal file manager
brew "lf"
# Postgres C API library
brew "libpq", link: true
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Create, run, and share large language models (LLMs)
brew "ollama", restart_service: true
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Rsync for cloud storage
brew "rclone"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Readline wrapper: adds readline support to tools that lack it
brew "rlwrap"
# Editor of encrypted files
brew "sops"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Terminal multiplexer
brew "tmux"
# Internet file retriever
brew "wget"
brew "chiselstrike/tap/turso"
# MinIO Client for object storage and filesystems
brew "minio/stable/mc"
# Enable Windows-like alt-tab
cask "alt-tab"
# Chromium based browser
cask "arc"
# Cross platform SQL editor and database management app
cask "beekeeper-studio"
# Voice and text chat software
cask "discord"
# Web browser
cask "firefox-developer-edition"
# Developer targeted fonts with a high number of glyphs
cask "font-fira-code-nerd-font"
# Superfamily of fonts for code
cask "font-monaspace"
# Git client for simultaneous branches on top of your existing workflow
cask "gitbutler"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customiser
cask "karabiner-elements"
# WordPress local development tool by Flywheel
cask "local"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# Interactive tool for analyzing MongoDB data
cask "mongodb-compass"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Client program for the OpenVPN Access Server
cask "openvpn-connect"
# Replacement for Docker Desktop
cask "orbstack"
# Tool to create and manage Outline servers, powered by Shadowsocks
cask "outline-manager"
# All-in-one bookmark manager
cask "raindropio"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Control your tools with a few keystrokes
cask "raycast"
# Modified browser that helps in responsive web development
cask "responsively"
# Instant messaging application focusing on security
cask "signal"
# Messaging app with a focus on speed and security
cask "telegram"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# HTML to PDF renderer
cask "wkhtmltopdf"
# Multiplayer code editor
cask "zed"
vscode "aaron-bond.better-comments"
vscode "abuisman.multiline-vim"
vscode "adpyke.vscode-sql-formatter"
vscode "ahmadalli.vscode-nginx-conf"
vscode "alefragnani.bookmarks"
vscode "alexcvzz.vscode-sqlite"
vscode "angular.ng-template"
vscode "antfu.slidev"
vscode "antfu.unocss"
vscode "arcanis.vscode-zipfs"
vscode "astro-build.astro-vscode"
vscode "asvetliakov.vscode-neovim"
vscode "batisteo.vscode-django"
vscode "betajob.modulestf"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "ctc.vscode-tree-extension"
vscode "darkriszty.markdown-table-prettify"
vscode "davidanson.vscode-markdownlint"
vscode "davidwang.ini-for-vscode"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "eliostruyf.vscode-front-matter"
vscode "esbenp.prettier-vscode"
vscode "evhub.coconut"
vscode "firsttris.vscode-jest-runner"
vscode "fivethree.vscode-svelte-snippets"
vscode "foxundermoon.shell-format"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "goopware.raythis"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "humao.rest-client"
vscode "inercia.vscode-k3d"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "ipedrazas.kubernetes-snippets"
vscode "jakearl.handydandy-notebook"
vscode "janisdd.vscode-edit-csv"
vscode "jigar-patel.odoosnippets"
vscode "jock.svg"
vscode "luyuhuang.rss"
vscode "mads-hartmann.bash-ide-vscode"
vscode "marp-team.marp-vscode"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "mirone.milkdown"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-pg"
vscode "mushan.vscode-paste-image"
vscode "njpwerner.autodocstring"
vscode "nrwl.angular-console"
vscode "octref.vetur"
vscode "oderwat.indent-rainbow"
vscode "perkovec.emoji"
vscode "pflannery.vscode-versionlens"
vscode "pnp.polacode"
vscode "pomdtr.excalidraw-editor"
vscode "prisma.prisma"
vscode "quicktype.quicktype"
vscode "randomfractalsinc.vscode-data-preview"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "scapigliato.vsc-odoo-development"
vscode "selemondev.vscode-shadcn-svelte"
vscode "sourcegraph.cody-ai"
vscode "sourcegraph.sourcegraph"
vscode "stanislav.vscode-nginx-unit"
vscode "stateful.marquee"
vscode "streetsidesoftware.code-spell-checker"
vscode "sumneko.lua"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "thomascsd.vscode-readme-pattern"
vscode "tim-koehler.helm-intellisense"
vscode "tintinweb.graphviz-interactive-preview"
vscode "tomoki1207.pdf"
vscode "trinhanhngoc.vscode-odoo"
vscode "trond-snekvik.simple-rst"
vscode "tyriar.sort-lines"
vscode "vscode-icons-team.vscode-icons"
vscode "vsls-contrib.gistfs"
vscode "wakatime.vscode-wakatime"
vscode "xabikos.javascriptsnippets"
vscode "xadillax.viml"
vscode "yoavbls.pretty-ts-errors"
vscode "yutengjing.vscode-archive"
vscode "yzhang.markdown-all-in-one"
