tap "chiselstrike/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/services"
brew "act"
brew "age"
brew "azcopy"
brew "bat"
brew "fontconfig"
brew "cloudflared"
brew "eget"
brew "exa"
brew "fd"
brew "gh"
brew "git"
brew "git-lfs"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "helm"
brew "jq"
brew "k3d"
brew "k9s"
brew "kubernetes-cli"
brew "kubectx"
brew "lazydocker"
brew "lazygit"
brew "lf"
brew "libpq", link: true
brew "mise"
brew "mkcert"
brew "neovim"
brew "openssl@1.1"
brew "rclone"
brew "ripgrep"
brew "rlwrap"
brew "sops"
brew "tesseract"
brew "tmux"
brew "wget"
brew "chiselstrike/tap/turso"
cask "alt-tab"
cask "arc"
cask "beekeeper-studio"
cask "font-fira-code-nerd-font"
cask "font-monaspace"
cask "google-chrome"
cask "iterm2"
cask "karabiner-elements"
cask "logseq"
cask "mongodb-compass"
cask "obsidian"
cask "openvpn-connect"
cask "orbstack"
cask "outline-manager"
cask "raindropio"
cask "raycast"
cask "responsively"
cask "signal"
cask "telegram"
cask "visual-studio-code"
cask "warp"
cask "wezterm"
cask "wkhtmltopdf"
vscode "42Crunch.vscode-openapi"
vscode "aaron-bond.better-comments"
vscode "abuisman.multiline-vim"
vscode "ahmadalli.vscode-nginx-conf"
vscode "alefragnani.Bookmarks"
vscode "alexcvzz.vscode-sqlite"
vscode "Angular.ng-template"
vscode "antfu.slidev"
vscode "antfu.unocss"
vscode "arcanis.vscode-zipfs"
vscode "astro-build.astro-vscode"
vscode "batisteo.vscode-django"
vscode "betajob.modulestf"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "CTC.vscode-tree-extension"
vscode "DavidAnson.vscode-markdownlint"
vscode "DavidWang.ini-for-vscode"
vscode "dbaeumer.vscode-eslint"
vscode "DotJoshJohnson.xml"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "eliostruyf.vscode-front-matter"
vscode "esbenp.prettier-vscode"
vscode "evhub.coconut"
vscode "firsttris.vscode-jest-runner"
vscode "fivethree.vscode-svelte-snippets"
vscode "foxundermoon.shell-format"
vscode "GitHub.codespaces"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.copilot-labs"
vscode "GitHub.remotehub"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "golang.go"
vscode "Goopware.raythis"
vscode "GraphQL.vscode-graphql"
vscode "GraphQL.vscode-graphql-syntax"
vscode "Gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "humao.rest-client"
vscode "inercia.vscode-k3d"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "jakearl.handydandy-notebook"
vscode "janisdd.vscode-edit-csv"
vscode "jigar-patel.OdooSnippets"
vscode "jock.svg"
vscode "luyuhuang.rss"
vscode "mads-hartmann.bash-ide-vscode"
vscode "marp-team.marp-vscode"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "mindaro-dev.file-downloader"
vscode "mirone.milkdown"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-pg"
vscode "mushan.vscode-paste-image"
vscode "nrwl.angular-console"
vscode "oderwat.indent-rainbow"
vscode "Perkovec.emoji"
vscode "pflannery.vscode-versionlens"
vscode "PKief.material-icon-theme"
vscode "pnp.polacode"
vscode "pomdtr.excalidraw-editor"
vscode "Prisma.prisma"
vscode "quicktype.quicktype"
vscode "RandomFractalsInc.vscode-data-preview"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.LiveServer"
vscode "scapigliato.vsc-odoo-development"
vscode "Selemondev.vscode-shadcn-svelte"
vscode "sourcegraph.sourcegraph"
vscode "stateful.marquee"
vscode "streetsidesoftware.code-spell-checker"
vscode "sumneko.lua"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "thomascsd.vscode-readme-pattern"
vscode "Tim-Koehler.helm-intellisense"
vscode "tintinweb.graphviz-interactive-preview"
vscode "tomoki1207.pdf"
vscode "trond-snekvik.simple-rst"
vscode "Tyriar.sort-lines"
vscode "vscode-icons-team.vscode-icons"
vscode "vsls-contrib.gistfs"
vscode "Vue.volar"
vscode "WakaTime.vscode-wakatime"
vscode "XadillaX.viml"
vscode "YoavBls.pretty-ts-errors"
vscode "YuTengjing.vscode-archive"
vscode "yzhang.markdown-all-in-one"
