tap "fluxcd/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "pulumi/tap"
tap "rsteube/tap"
brew "act"
brew "asdf"
brew "azcopy"
brew "bat"
brew "chezmoi"
brew "colima"
brew "docker"
brew "docker-compose"
brew "exa"
brew "fd"
brew "gh"
brew "gnupg"
brew "helmfile"
brew "hyperfine"
brew "jq"
brew "k3d"
brew "k9s"
brew "kubectx"
brew "lazydocker"
brew "lazygit"
brew "lf"
brew "mkcert"
brew "neovim"
brew "pipx"
brew "postgresql"
brew "ripgrep"
brew "sops"
brew "terraform"
brew "tmux"
brew "tree"
brew "fluxcd/tap/flux"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai", args: ["HEAD"]
brew "pulumi/tap/pulumi"
brew "rsteube/tap/carapace"
cask "alt-tab"
cask "beekeeper-studio"
cask "font-fira-code-nerd-font"
cask "google-chrome"
cask "iterm2"
cask "karabiner-elements"
cask "logseq"
cask "masscode"
cask "microsoft-auto-update"
cask "microsoft-azure-storage-explorer"
cask "microsoft-office"
cask "microsoft-teams"
cask "notion"
cask "obsidian"
cask "outline-manager"
cask "raycast"
cask "spotify"
cask "telegram"
cask "visual-studio-code"
cask "wkhtmltopdf"
